In [202]:
import pandas

df = pandas.read_csv(r'C:\Local\python-training\Day-11\sample-question.csv')
df

  Name  Age  Salary
0    A   20    2000
1    A   21    2000
2    B   22    3000
3    A   19    3000

In [203]:
df[df['Age'] >= 20]

  Name  Age  Salary
0    A   20    2000
1    A   21    2000
2    B   22    3000

In [204]:
df.loc[(df['Age'] >= 20), 'Salary'] = df['Salary']*2
df

  Name  Age  Salary
0    A   20    4000
1    A   21    4000
2    B   22    6000
3    A   19    3000